// Задача №1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

for(let i = 20; i<=30; i+=0.5) {
    console.log(i);
}

//Задача №2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let i = 27
for (a = 10; a <= 100; a+=10) {
    console.log(`Ваши ${a} долларів  коштують ${i*a} гривень`);
}

// Задача №3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let num = 50;
for(i = 1; i < 100; i++) {
    if(i*i<num) {
        console.log(i);
    }
}



// Задача №4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let n = 17;
let primeNum = true;

for (let i = 2; i < n; i++) {
  if (n % i === 0) {
    primeNum = false;
    break;
  }
}

if (primeNum) {
  console.log(n + " это простое число");
} else {
  console.log(n + " это число не является простым");
}

//Задача №5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let a = 243; // заданное число
let b = 0; // начальная степень

while (Math.pow(3, b) <= a) {
  if (Math.pow(3, b) === a) {
    console.log(a + " получается путем возведения числа 3 в степень " + b);
    break;
  }
  b++;
}

if (Math.pow(3, b) > a) {
  console.log(a + " не получается путем возведения числа 3 в некоторую степень");
}




